/*        Лабораторна робота № 3 . Виконала Рацебарська Альона, ст.гр. АКТСІз-23-1
                                УМОВНІ ОПЕРАТОРИ МОВИ C

                                        Варіант 2

    1. Оператор if: Написати програму перевірки попадання введеного
       числа в діапазон від -2 до 2.

    2. Оператор case: Написати програму перекладу введеного символу
       від A до F в нижній регістр
*/

#include <iostream>
#include <cctype> // Для використання функції tolower()
using namespace std;

int main() {
   // Частина 1: Перевірка числа
   double num;
   cout << "Введіть число для перевірки: ";
   cin >> num;

   if (num >= -2 && num <= 2) {
      cout << "Число " << num << " знаходиться в діапазоні від -2 до 2.\n";
   } else {
      cout << "Число " << num << " не знаходиться в діапазоні від -2 до 2.\n";
   }

   // Частина 2: Переклад символу в нижній регістр
   char ch;
   cout << "Введіть символ від A до F: ";
   cin >> ch;

   switch (ch) {
      case 'A':
      case 'B':
      case 'C':
      case 'D':
      case 'E':
      case 'F':
         cout << "Символ у нижньому регістрі: " << char(tolower(ch)) << "\n";
         break;
      default:
         cout << "Введено неправильний символ.\n";
   }

   return 0;
}
      